// ---------------------------------------------------------------
// 숫자(number) 값 : number value or literal
// ---------------------------------------------------------------
// 실수
100;
// 정수
98;
// 소수
0.071;
// 음수
-1.07;

// ---------------------------------------------------------------
// 문자(string) 값
// 작은 따옴표('), 큰 따옴표("), 역 따옴표(backtick, `)
// 프로그램 문장이 끝날 때 마침을 의미하는 세미콜론(;) 추가
// ---------------------------------------------------------------
// 작은 따옴표
("2px");
// 큰 따옴표
("20mm");
// 역 따옴표
`2inch`;

// ---------------------------------------------------------------
// 논리(boolean) 값
// 진실(Truthy, true)
// 거짓(Falsy, false)
// ---------------------------------------------------------------

// 프로그램이 허용하지 않는 문자
// X truthy;
// X falsy;
// X yes
// X ok
// X no

// 프로그램이 허용하는 불리언 값
true;
false;

// 터미널 값 출력

// 주석 한 줄 (single line comment)

/*
여러 줄
주석 작성(multi line comment)
*/
