// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
const studentName = "김철수";
// - 나이(변수)
let studentAge = "50";
// - 학생 여부(상수)
const studentStatus = "YES";
// - 모든 정보를 한 번에 출력해보세요.
console.log(studentName, studentAge, studentStatus);

// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const number1 = 1;
// - 숫자2(상수)
const number2 = 2;
// - 결과(변수)
let result = number1 + number2;

console.log(result);

// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const productName = "마우스";
// - 가격(변수)
let proudctPrice = 10_000;
// - 재고 있음(변수)
let productInventory = 50;
// - 할인율(상수)
const productSale = 0.1;

console.log(productName, proudctPrice, productInventory, productSale);
